import React from 'react';

Object.prototype.getKey = function(value) {
  for(var key in this){
    if(this[key] == value){
      return key;
    }
  }
  return "";
};

Object.prototype.hasValue = function(value) {
  for(var key in this){
    if(this[key] == value){
      return true;
    }
  }
  return false;
};

function getRandomInt(max) {
  return Math.floor(Math.random() * Math.floor(max));
}

const keyWord = {
  'А': 'жжжжжжж',
  'Б': 'жжжжжжЖ',
  'В': 'жжжжжЖж',
  'Г': 'жжжжжЖЖ',
  'Д': 'жжжжЖжж',
  'Е': 'жжжжЖжЖ',
  'Ё': 'жжжжЖЖж',
  'Ж': 'жжжжЖЖЖ',
  'З': 'жжжЖжжж',
  'И': 'жжжЖжжЖ',
  'Й': 'жжжЖжЖж',
  'К': 'жжжЖжЖЖ',
  'Л': 'жжжЖЖжж',
  'М': 'жжжЖЖжЖ',
  'Н': 'жжжЖЖЖж',
  'О': 'жжжЖЖЖЖ',
  'П': 'жжЖжжжж',
  'Р': 'жжЖжжжЖ',
  'С': 'жжЖжжЖж',
  'Т': 'жжЖжжЖЖ',
  'У': 'жжЖжЖжж',
  'Ф': 'жжЖжЖжЖ',
  'Х': 'жжЖжЖЖж',
  'Ц': 'жжЖжЖЖЖ',
  'Ч': 'жжЖЖжжж',
  'Ш': 'жжЖЖжжЖ',
  'Щ': 'жжЖЖжЖж',
  'Ъ': 'жжЖЖжЖЖ',
  'Ы': 'жжЖЖЖжж',
  'Ь': 'жжЖЖЖжЖ',
  'Э': 'жжЖЖЖЖж',
  'Ю': 'жжЖЖЖЖЖ',
  'Я': 'жЖжжжжж',
  'а': 'жЖжжжжЖ',
  'б': 'жЖжжжЖж',
  'в': 'жЖжжжЖЖ',
  'г': 'жЖжжЖжж',
  'д': 'жЖжжЖжЖ',
  'е': 'жЖжжЖЖж',
  'ё': 'жЖжжЖЖЖ',
  'ж': 'жЖжЖжжж',
  'з': 'жЖжЖжжЖ',
  'и': 'жЖжЖжЖж',
  'й': 'жЖжЖжЖЖ',
  'к': 'жЖжЖЖжж',
  'л': 'жЖжЖЖжЖ',
  'м': 'жЖжЖЖЖж',
  'н': 'жЖжЖЖЖЖ',
  'о': 'жЖЖжжжж',
  'п': 'жЖЖжжжЖ',
  'р': 'жЖЖжжЖж',
  'с': 'жЖЖжжЖЖ',
  'т': 'жЖЖжЖжж',
  'у': 'жЖЖжЖжЖ',
  'ф': 'жЖЖжЖЖж',
  'х': 'жЖЖжЖЖЖ',
  'ц': 'жЖЖЖжжж',
  'ч': 'жЖЖЖжжЖ',
  'ш': 'жЖЖЖжЖж',
  'щ': 'жЖЖЖжЖЖ',
  'ъ': 'жЖЖЖЖжж',
  'ы': 'жЖЖЖЖжЖ',
  'ь': 'жЖЖЖЖЖж',
  'э': 'жЖЖЖЖЖЖ',
  'ю': 'Жжжжжжж',
  'я': 'ЖжжжжжЖ',
  ',': 'ЖжжжжЖж',
  '!': 'ЖжжжжЖЖ',
  '.': 'ЖжжжЖжж',
  '?': 'ЖжжжЖжЖ',
  ')': 'ЖжжжЖЖж',
  '(': 'ЖжжжЖЖЖ',
  '-': 'ЖжжЖжжж',
  '"': 'ЖжжЖжжЖ',
  '1': 'ЖжжЖжЖж',
  '2': 'ЖжжЖжЖЖ',
  '3': 'ЖжжЖЖжж',
  '4': 'ЖжжЖЖжЖ',
  '5': 'ЖжжЖЖЖж',
  '6': 'ЖжжЖЖЖЖ',
  '7': 'ЖжЖжжжж',
  '8': 'ЖжЖжжжЖ',
  '9': 'ЖжЖжжЖж',
  '0': 'ЖжЖжжЖЖ',
  '+': 'ЖжЖжЖжж',
  '/': 'ЖжЖжЖжЖ',
  '*': 'ЖжЖжЖЖж',
  ':': 'ЖжЖжЖЖЖ',
  ' ': 'в',
  '': ' '
}

export default class Translator extends React.Component {
  toVzuh = (text) => {
    var res = "";
    for (var i = 0; i< text.length; i++) {
      var tmp = text.charAt(i);
      if (keyWord.hasOwnProperty(tmp)) {
        res += keyWord[tmp];
        var r = getRandomInt(100);
        if (r > 50) {
          res += ' ';
        }
      }
    }
    return res;
  }
  toText = (vzuh) => {
    var res = "";
    var tmp = "";
    for (var i = 0; i< vzuh.length; i++) {
      tmp += vzuh.charAt(i);
      if (keyWord.hasValue(tmp) && (tmp.length == 7 || tmp.length == 1)) {
        res += keyWord.getKey(tmp);
        tmp = "";
      }
    }
    return res;
  }
}
